In [28]:
import pandas as pd
import  numpy as np

In [29]:
df= pd.read_csv('house_data.csv')

In [30]:
df

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
0,7.129301e+09,20141013T000000,221900.0,3.0,1.00,1180.0,5650.0,1.0
1,6.414100e+09,20141209T000000,538000.0,3.0,2.25,2570.0,7242.0,2.0
2,5.631500e+09,20150225T000000,180000.0,2.0,1.00,770.0,10000.0,1.0
3,2.487201e+09,20141209T000000,604000.0,4.0,3.00,1960.0,5000.0,1.0
4,1.954401e+09,20150218T000000,510000.0,3.0,2.00,1680.0,8080.0,1.0
...,...,...,...,...,...,...,...,...
21602,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21603,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21604,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21605,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21606,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [31]:
rows,columns= df.shape
print(rows,columns)

21607 8

In [32]:
df.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
count,9.900000e+01,9.900000e+01,99.000000,99.000000,99.000000,99.000000,99.000000
mean,4.664620e+09,5.200763e+05,3.404040,1.989899,2086.383838,11478.818182,1.464646
std,2.935212e+09,3.061939e+05,0.794358,0.729236,864.592421,14655.249813,0.511363
min,1.600040e+07,1.530000e+05,2.000000,1.000000,770.000000,1044.000000,1.000000
25%,1.914950e+09,3.070000e+05,3.000000,1.500000,1410.000000,5000.000000,1.000000
50%,4.036801e+09,4.300000e+05,3.000000,2.000000,1900.000000,6720.000000,1.500000
75%,7.337325e+09,6.562500e+05,4.000000,2.500000,2570.000000,9823.000000,2.000000
max,9.822700e+09,2.000000e+06,5.000000,4.500000,5420.000000,101930.000000,3.000000

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21607 entries, 0 to 21606
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           99 non-null     float64
 1   date         99 non-null     object
 2   price        99 non-null     float64
 3   bedrooms     99 non-null     float64
 4   bathrooms    99 non-null     float64
 5   sqft_living  99 non-null     float64
 6   sqft_lot     99 non-null     float64
 7   floors       99 non-null     float64
dtypes: float64(7), object(1)
memory usage: 1.3+ MB

In [34]:
df.head(6)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
0,7.129301e+09,20141013T000000,221900.0,3.0,1.00,1180.0,5650.0,1.0
1,6.414100e+09,20141209T000000,538000.0,3.0,2.25,2570.0,7242.0,2.0
2,5.631500e+09,20150225T000000,180000.0,2.0,1.00,770.0,10000.0,1.0
3,2.487201e+09,20141209T000000,604000.0,4.0,3.00,1960.0,5000.0,1.0
4,1.954401e+09,20150218T000000,510000.0,3.0,2.00,1680.0,8080.0,1.0
5,7.237550e+09,20140512T000000,1230000.0,4.0,4.50,5420.0,101930.0,1.0

In [35]:
df.tail(6)

       id date  price  bedrooms  bathrooms  sqft_living  sqft_lot  floors
21601 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21602 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21603 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21604 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21605 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21606 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN

In [36]:
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors'],
      dtype='object')

In [37]:
df['price']

0        221900.0
1        538000.0
2        180000.0
3        604000.0
4        510000.0
           ...
21602         NaN
21603         NaN
21604         NaN
21605         NaN
21606         NaN
Name: price, Length: 21607, dtype: float64

In [38]:
df[['id','bedrooms','floors','price']]

                 id  bedrooms  floors     price
0      7.129301e+09       3.0     1.0  221900.0
1      6.414100e+09       3.0     2.0  538000.0
2      5.631500e+09       2.0     1.0  180000.0
3      2.487201e+09       4.0     1.0  604000.0
4      1.954401e+09       3.0     1.0  510000.0
...             ...       ...     ...       ...
21602           NaN       NaN     NaN       NaN
21603           NaN       NaN     NaN       NaN
21604           NaN       NaN     NaN       NaN
21605           NaN       NaN     NaN       NaN
21606           NaN       NaN     NaN       NaN

[21607 rows x 4 columns]

In [39]:
df.price.max()

2000000.0

In [40]:
df.price.min()

153000.0

In [41]:
df.price.mean()

520076.31313131313

In [42]:
df.fillna(0,inplace= True)
df.price.mean()

2382.9108622205767

In [43]:
df.price.isnull().sum()

0

In [44]:
df.price.unique()

array([ 221900.,  538000.,  180000.,  604000.,  510000., 1230000.,
        257500.,  291850.,  229500.,  323000.,  662500.,  468000.,
        310000.,  400000.,  530000.,  650000.,  395000.,  485000.,
        189000.,  230000.,  385000., 2000000.,  285000.,  252700.,
        329000.,  233000.,  937000.,  667000.,  438000.,  719000.,
        580500.,  280000.,  687500.,  535000.,  322500.,  696000.,
        550000.,  640000.,  240000.,  605000.,  625000.,  775000.,
        861990.,  685000.,  309000.,  488000.,  210490.,  785000.,
        450000., 1350000.,  228000.,  345000.,  600000.,  585000.,
        920000.,  885000.,  292500.,  301000.,  951000.,  430000.,
        289000.,  505000.,  549000.,  425000.,  317625.,  975000.,
        287000.,  204000., 1330000., 1040000.,  325000.,  571000.,
        360000.,  349000.,  832500.,  380000.,  480000.,  410000.,
        720000.,  390000.,  355000.,  356000.,  315000.,  940000.,
        305000.,  461000.,  215000.,  335000.,  243500., 1100000.,
        153000.,  700000.,  905000.,  247500.,  199000.,  314000.,
             0.])

In [45]:
df['price'].replace(to_replace = np.nan, value = 0, inplace = True)
df.price.unique()

array([ 221900.,  538000.,  180000.,  604000.,  510000., 1230000.,
        257500.,  291850.,  229500.,  323000.,  662500.,  468000.,
        310000.,  400000.,  530000.,  650000.,  395000.,  485000.,
        189000.,  230000.,  385000., 2000000.,  285000.,  252700.,
        329000.,  233000.,  937000.,  667000.,  438000.,  719000.,
        580500.,  280000.,  687500.,  535000.,  322500.,  696000.,
        550000.,  640000.,  240000.,  605000.,  625000.,  775000.,
        861990.,  685000.,  309000.,  488000.,  210490.,  785000.,
        450000., 1350000.,  228000.,  345000.,  600000.,  585000.,
        920000.,  885000.,  292500.,  301000.,  951000.,  430000.,
        289000.,  505000.,  549000.,  425000.,  317625.,  975000.,
        287000.,  204000., 1330000., 1040000.,  325000.,  571000.,
        360000.,  349000.,  832500.,  380000.,  480000.,  410000.,
        720000.,  390000.,  355000.,  356000.,  315000.,  940000.,
        305000.,  461000.,  215000.,  335000.,  243500., 1100000.,
        153000.,  700000.,  905000.,  247500.,  199000.,  314000.,
             0.])

In [46]:
df.price.value_counts()

0.0         21508
650000.0        2
430000.0        2
360000.0        2
199000.0        1
            ...
210490.0        1
323000.0        1
580500.0        1
243500.0        1
450000.0        1
Name: price, Length: 97, dtype: int64

In [47]:
df[df.price == df.price.max()]

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
21,2.524049e+09,20140826T000000,2000000.0,3.0,2.75,3050.0,44867.0,1.0

In [48]:
df['price'][df['bedrooms'] == 3.0]  #Prints ONLY price of entries with 3 bedrooms

0      221900.0
1      538000.0
4      510000.0
6      257500.0
7      291850.0
8      229500.0
9      323000.0
10     662500.0
12     310000.0
13     400000.0
16     395000.0
19     230000.0
21    2000000.0
24     329000.0
25     233000.0
26     937000.0
27     667000.0
28     438000.0
30     580500.0
33     535000.0
35     696000.0
43     685000.0
44     309000.0
45     488000.0
46     210490.0
48     450000.0
49    1350000.0
50     228000.0
52     600000.0
57     301000.0
60     650000.0
61     289000.0
62     505000.0
63     549000.0
64     425000.0
65     317625.0
68     204000.0
71     325000.0
74     349000.0
77     480000.0
78     410000.0
80     390000.0
83     356000.0
84     315000.0
85     940000.0
87     461000.0
92     153000.0
93     430000.0
94     700000.0
96     247500.0
98     314000.0
Name: price, dtype: float64

In [49]:
df[['id','price', 'floors']][df['bedrooms'] == 3.0] [df['bathrooms']==2.0] #prints id,price and floors with 3 bedrooms and 2 bathrooms

C:\Users\Manali\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

              id     price  floors
4   1.954401e+09  510000.0     1.0
16  1.875500e+09  395000.0     2.0
25  1.202000e+09  233000.0     1.5
71  1.049000e+09  325000.0     1.0

In [50]:
df.set_index('sqft_lot', inplace=True)

In [52]:
df.loc[8080]

id                  1.9544e+09
date           20150218T000000
price                   510000
bedrooms                     3
bathrooms                    2
sqft_living               1680
floors                       1
Name: 8080.0, dtype: object

In [53]:
df.reset_index(inplace=True)

In [54]:
df.loc[4]

sqft_lot                  8080
id                  1.9544e+09
date           20150218T000000
price                   510000
bedrooms                     3
bathrooms                    2
sqft_living               1680
floors                       1
Name: 4, dtype: object

In [55]:
df.rename(columns = {'sqft_living':'sqft'}, inplace = True)

In [56]:
df.head(3)

,sqft_lot,id,date,price,bedrooms,bathrooms,sqft,floors
0,5650.0,7.129301e+09,20141013T000000,221900.0,3.0,1.00,1180.0,1.0
1,7242.0,6.414100e+09,20141209T000000,538000.0,3.0,2.25,2570.0,2.0
2,10000.0,5.631500e+09,20150225T000000,180000.0,2.0,1.00,770.0,1.0

In [57]:
df1 = df.copy()

In [58]:
train = df1.sample(frac=0.75, random_state=1)
test = df1.drop(train.index)

In [59]:
train

       sqft_lot   id date  price  bedrooms  bathrooms  sqft  floors
19338       0.0  0.0    0    0.0       0.0        0.0   0.0     0.0
12150       0.0  0.0    0    0.0       0.0        0.0   0.0     0.0
4208        0.0  0.0    0    0.0       0.0        0.0   0.0     0.0
4014        0.0  0.0    0    0.0       0.0        0.0   0.0     0.0
4421        0.0  0.0    0    0.0       0.0        0.0   0.0     0.0
...         ...  ...  ...    ...       ...        ...   ...     ...
15047       0.0  0.0    0    0.0       0.0        0.0   0.0     0.0
20125       0.0  0.0    0    0.0       0.0        0.0   0.0     0.0
16059       0.0  0.0    0    0.0       0.0        0.0   0.0     0.0
17110       0.0  0.0    0    0.0       0.0        0.0   0.0     0.0
422         0.0  0.0    0    0.0       0.0        0.0   0.0     0.0

[16205 rows x 8 columns]

In [60]:
test.count()

sqft_lot     5402
id           5402
date         5402
price        5402
bedrooms     5402
bathrooms    5402
sqft         5402
floors       5402
dtype: int64